cf_billing/InformationRegisters/энргОтложенныеДвиженияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргОтложенныеДвиженияДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргРазделыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргНачислениеНаПрочиеУслуги</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРаспределениеПомещения</v8:Type>
						<v8:Type>cfg:DocumentRef.энргВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.энргДополнительныеНачисления</v8:Type>
						<v8:Type>cfg:DocumentRef.энргВводНачальныхОстатковМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачислениеМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачисление</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРаспределениеМКД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргОтложенныеДвиженияДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Удалось ли очистить набор записей.
//
// Параметры:
//  Организация			-	СправочникСсылка.Организации.
//  ПериодНачисления	-	Дата.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  РазделЗаписи		-	ПеречислениеСсылка.энргРазделыЗаписи.
//  МКД					-	СправочникСсылка.энргСтроения.
// 
// Возвращаемое значение:
//   Булево.
//
Функция УдалосьОчиститьНаборЗаписей(Организация, ПериодНачисления, Район, РазделЗаписи, МКД = Неопределено) Экспорт 
	
	Набор 								= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
	Набор.Отбор.Организация.Установить(Организация);
	Набор.Отбор.ПериодНачисления.Установить(ПериодНачисления);
	Набор.Отбор.Район.Установить(Район);
	Набор.Отбор.РазделЗаписи.Установить(РазделЗаписи);
	Если Не МКД = Неопределено Тогда
		ЧастныйСектор 					= НЕ ЗначениеЗаполнено(МКД);
		Набор.Отбор.ЧастныйСектор.Установить(ЧастныйСектор);
		Если Не ЧастныйСектор Тогда
			Набор.Отбор.Строение.Установить(МКД);
		КонецЕсли; 			
	КонецЕсли;
	
	Попытка
		Набор.Записать();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецЕсли
